cf/Enums/ServicesTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ServicesTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Unlimited</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Limited</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unique</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ServicesTypes/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Parameters: 
//  EnumValueName - String
// 
// Returns:
//  EnumRef.ServicesTypes
//	
Function ValueByName(EnumValueName) Export
	
	If EnumValueName = "unlimited" Then
		Return PredefinedValue("Enum.ServicesTypes.Unlimited");
	ElsIf EnumValueName = "limited" Then
		Return PredefinedValue("Enum.ServicesTypes.Limited");
	ElsIf EnumValueName = "unique" Then
		Return PredefinedValue("Enum.ServicesTypes.Unique");
	Else
		Return PredefinedValue("Enum.ServicesTypes.EmptyRef");
	EndIf;
	
EndFunction

#EndRegion

#EndIf
